{
  "posts": [
    {
      "id": 1,
      "title": "Travel Essentials for a Long Flight",
      "body": "This post was originally published two years ago, but it’s been one of my most popular posts to-date, so I’ve brought it back with a fresh new look and updated products! Why? Because long flights are no joke. If I’m very lucky I’ll get 2-3 hours of sleep which still leaves hours of just sitting there. I’ve learned a thing or two about getting through a long flight over the past few years, so here’s a list of the travel essentials I rely on.",
      "authorId": 1
    },
    {
      "id": 2,
      "title": "What We’re Buying For Our New Home",
      "body": "Our move is just one month away, so we’re in the process ordering furniture and looking for some vintage finds, too. We’re going for a modern-meets-traditional vibe this time around – a lighter, cozier feel. The anticipation of making this home feel cozy and settled (and then staying put for a while) has me pretty excited.",
      "authorId": 2
    },
    {
      "id": 3,
      "title": "Life Lately: The Everymom is Here!",
      "body": "When Alaina and I found ourselves expecting our first babies just seven weeks apart (she’s due at the end of May and I’m due in early July) we knew it was finally put the domain we bought a few years ago to use. The Everygirl launched six years ago back when I was a 20-something trying to figure out my career, finances, relationships, when/how to eventually take a trip to Europe, and everything in between. So we launched a site to inspire creative, career-driven women like us who were on that journey with us.",
      "authorId": 1
    },
    {
      "id": 4,
      "title": "My Experience with Tinder and Online Dating",
      "body": "Chances are the app has changed a little in the past 3 years and according to the 20-somethings I know, it’s all about Hinge right now. So I can share my experience and talk about online dating in general because our story is proof that it does work. I tried Bumble and Hinge for a day or two – both weren’t much of a thing yet. And Tinder was one of those things I’d do for a week and then delete my profile because I just couldn’t deal, so it was very on and off.",
      "authorId": 2
    },
    {
      "id": 5,
      "title": "Life Lately And A Big Announcement!",
      "body": "Remember when I used to post about what was going on in my life every few weeks? Well, I haven’t written one of those posts since January and here we are over a week into April, so it’s time for a catchup. I don’t know about you, but I love these update posts since they’re fun (at least for me) to look back on. Is it just me? Without them, never know what I did when. But really.",
      "authorId": 2
    },
    {
      "title": "ira",
      "body": "ok",
      "authorId": 2,
      "id": 6
    },
    {
      "title": "Bodrum",
      "body": "Бодрум (тур. Bodrum) — район и город в провинции Мугла, на севере залива Гёкова в Эгейском море, напротив греческого острова Кос, примерно в 300 км к западу от Антальи. Население в городе Бодрум составляло 35 795 человек по данным переписи 2012 года. В окружающих городах и деревнях было дополнительно 100 522 человека, в общей сложности для провинции 136 317. Постоянное население 31 тыс. жителей.",
      "authorId": 1,
      "id": 7
    },
    {
      "title": "Promise",
      "body": "Promise (обычно их так и называют «промисы») – предоставляют удобный способ организации асинхронного кода.\n\nВ современном JavaScript промисы часто используются в том числе и неявно, при помощи генераторов, но об этом чуть позже.",
      "authorId": 2,
      "id": 8
    }
  ],
  "authors": [
    {
      "id": 1,
      "first_name": "Irina",
      "last_name": "Gutu",
      "bio": "Always travelling"
    },
    {
      "id": 2,
      "first_name": "Vitalic",
      "last_name": "Gutu",
      "bio": "Some cool bio"
    }
  ],
  "comments": [
    {
      "id": 1,
      "first_name": "Irina",
      "comment": "Always travelling",
      "postId": 1
    },
    {
      "id": 2,
      "first_name": "Vitalic",
      "comment": "Some cool bio",
      "postId": 2
    },
    {
      "first_name": "Irina",
      "comment": "love me",
      "postId": 1,
      "id": 3
    },
    {
      "first_name": "Andrey",
      "comment": "hours of just sitting there. I’ve learned a thing or two about getting through a long flight over the past few years, so here’s a list of the travel essentials I rely on.\nBack Home",
      "postId": 1,
      "id": 4
    },
    {
      "first_name": "Vitalie",
      "comment": "Very interesting",
      "postId": 7,
      "id": 5
    },
    {
      "first_name": "Vitalie",
      "comment": "В древности на месте Бодрума стояла столица Карии — богатый город Галикарнас. Галикарнасский мавзолей считался одним из семи чудес света. В Средние века на его руинах возник греческий рыбацкий посёлок. Halicarnassus (Древнегреческий: Ἁλικαρνᾱσσός Halikarnassós или Ἀλικαρνασσός Аликарнас, турецкий: Галикарнас) был древним греческим городом на месте современного Бодрума в Турции. Галикарнас был основан греками Дориана, а фигуры на его монетах, такие как голова Медузы, Афины или Посейдона или трезубец, подтверждают утверждение, что городами-матерями были Троез и Аргос.[1]",
      "postId": 7,
      "id": 6
    },
    {
      "first_name": "ira",
      "comment": "comment",
      "postId": 4,
      "id": 7
    },
    {
      "first_name": "asdsadas",
      "comment": "sadas",
      "postId": 2,
      "id": 8
    },
    {
      "first_name": "ASx",
      "comment": "ZX",
      "postId": 6,
      "id": 9
    },
    {
      "first_name": "ok",
      "comment": "ok",
      "postId": 5,
      "id": 10
    },
    {
      "first_name": "irisha",
      "comment": "ira",
      "postId": "undefined",
      "id": 11
    },
    {
      "first_name": "ok",
      "comment": "okokok",
      "postId": "undefined",
      "id": 12
    }
  ]
}